emacs/emacs_keys.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>emacs_keys</title>
<!-- 2016-12-03 Sat 17:52 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">emacs_keys</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. base</a>
<ul>
<li><a href="#sec-1-1">1.1. normal</a></li>
</ul>
</li>
<li><a href="#sec-2">2. file editor</a>
<ul>
<li><a href="#sec-2-1">2.1. normal</a></li>
<li><a href="#sec-2-2">2.2. delete</a></li>
<li><a href="#sec-2-3">2.3. block</a></li>
<li><a href="#sec-2-4">2.4. editor</a></li>
<li><a href="#sec-2-5">2.5. other</a></li>
</ul>
</li>
<li><a href="#sec-3">3. find and replace</a>
<ul>
<li><a href="#sec-3-1">3.1. isearch</a></li>
<li><a href="#sec-3-2">3.2. simple search</a></li>
<li><a href="#sec-3-3">3.3. replace</a></li>
<li><a href="#sec-3-4">3.4. regexp</a></li>
<li><a href="#sec-3-5">3.5. Ispell</a></li>
<li><a href="#sec-3-6">3.6. abbrev</a></li>
</ul>
</li>
<li><a href="#sec-4">4. buffer and window</a>
<ul>
<li><a href="#sec-4-1">4.1. window</a></li>
<li><a href="#sec-4-2">4.2. buffer</a></li>
<li><a href="#sec-4-3">4.3. bookmark</a></li>
<li><a href="#sec-4-4">4.4. window block</a></li>
</ul>
</li>
<li><a href="#sec-5">5. emacs work</a>
<ul>
<li><a href="#sec-5-1">5.1. shell</a></li>
<li><a href="#sec-5-2">5.2. Dired</a></li>
<li><a href="#sec-5-3">5.3. print</a></li>
<li><a href="#sec-5-4">5.4. time</a></li>
<li><a href="#sec-5-5">5.5. calendar</a></li>
</ul>
</li>
<li><a href="#sec-6">6. mail</a>
<ul>
<li><a href="#sec-6-1">6.1. mail send</a></li>
<li><a href="#sec-6-2">6.2. mail read</a></li>
<li><a href="#sec-6-3">6.3. del mail</a></li>
<li><a href="#sec-6-4">6.4. save mail</a></li>
<li><a href="#sec-6-5">6.5. gnus</a>
<ul>
<li><a href="#sec-6-5-1">6.5.1. summary</a></li>
<li><a href="#sec-6-5-2">6.5.2. filter</a></li>
<li><a href="#sec-6-5-3">6.5.3. post article</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-7">7. net tools</a>
<ul>
<li><a href="#sec-7-1">7.1. telnet</a></li>
<li><a href="#sec-7-2">7.2. w3</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> base</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> normal</h3>
<div class="outline-text-3" id="text-1-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-g</td>
<td class="left">keyboard-quit</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-f</td>
<td class="left">find-file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-v</td>
<td class="left">find-alternate-file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x i</td>
<td class="left">insert-file</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-s</td>
<td class="left">save-buffer</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x C-w</td>
<td class="left">write-file</td>
<td class="left"># other file</td>
</tr>

<tr>
<td class="left">C-x C-c</td>
<td class="left">save-buffers-kill-emacs</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-h</td>
<td class="left">help-command</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-h f</td>
<td class="left">describe-function</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-h k</td>
<td class="left">describe-key</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-h t</td>
<td class="left">help-with-tutorial</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-h i</td>
<td class="left">info-goto-emacs-command-mode</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> file editor</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> normal</h3>
<div class="outline-text-3" id="text-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-f</td>
<td class="left">forward-char</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-b</td>
<td class="left">backward-char</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-p</td>
<td class="left">previous-line</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-n</td>
<td class="left">next-line</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ESC e</td>
<td class="left">forward-sentence</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ESC a</td>
<td class="left">backward-sentend</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ESC }</td>
<td class="left">forward-paragraph</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ESC {</td>
<td class="left">backward-paragraph</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-v</td>
<td class="left">scroll-up</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">Esc v</td>
<td class="left">scroll-down</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x ]</td>
<td class="left">forward-page</td>
<td class="left"># curor</td>
</tr>

<tr>
<td class="left">C-x [</td>
<td class="left">backward-page</td>
<td class="left"># curor</td>
</tr>

<tr>
<td class="left">ESC &lt;</td>
<td class="left">beginning-of-buffer</td>
<td class="left"># file-header</td>
</tr>

<tr>
<td class="left">ESC &gt;</td>
<td class="left">end-of-buffer</td>
<td class="left"># file-end</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">goto-line</td>
<td class="left"># point lines</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">goto-char</td>
<td class="left"># point char</td>
</tr>

<tr>
<td class="left">C-l</td>
<td class="left">recenter</td>
<td class="left"># flush pic</td>
</tr>

<tr>
<td class="left">ESC n</td>
<td class="left">digit-argument</td>
<td class="left"># repeat command</td>
</tr>

<tr>
<td class="left">C-u n</td>
<td class="left">universal-argument</td>
<td class="left"># repeat command(defualt 4)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> delete</h3>
<div class="outline-text-3" id="text-2-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-d</td>
<td class="left">delete-char</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">DEL</td>
<td class="left">delete-backward-char</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ESC d</td>
<td class="left">kill-word</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">ESC DEL</td>
<td class="left">backward-kill-word</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-k</td>
<td class="left">kill-line</td>
<td class="left"># del to end line</td>
</tr>

<tr>
<td class="left">ESC k</td>
<td class="left">kill-sentence</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-x DEL</td>
<td class="left">backward-kill-sentence</td>
<td class="left"># sentence</td>
</tr>

<tr>
<td class="left">C-y/SHIFT-INSERT</td>
<td class="left">yank</td>
<td class="left"># resore</td>
</tr>

<tr>
<td class="left">C-w/SHIFT-DELETE</td>
<td class="left">kill-region</td>
<td class="left"># file-&gt;cut</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">kill-paragraph</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">backward-kill-paragraph</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> block</h3>
<div class="outline-text-3" id="text-2-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-@/C-SPACE</td>
<td class="left">set-mark-command</td>
</tr>

<tr>
<td class="left">C-x C-x</td>
<td class="left">exchange-point-and-mark</td>
</tr>

<tr>
<td class="left">ESC w/C-INSERT</td>
<td class="left">kill-ring-save</td>
</tr>

<tr>
<td class="left">ESC h</td>
<td class="left">mark-paragraph</td>
</tr>

<tr>
<td class="left">C-x C-p</td>
<td class="left">mark-page</td>
</tr>

<tr>
<td class="left">C-x h</td>
<td class="left">mark-whole-buffer</td>
</tr>

<tr>
<td class="left">ESC y</td>
<td class="left">yank-pop</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> editor</h3>
<div class="outline-text-3" id="text-2-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-t</td>
<td class="left">transpose-chars</td>
<td class="left"># change char</td>
</tr>

<tr>
<td class="left">ESC t</td>
<td class="left">transpose-words</td>
<td class="left"># change word</td>
</tr>

<tr>
<td class="left">C-x C-t</td>
<td class="left">transpose-lines</td>
<td class="left"># change line</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">transpose-sentences</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">transpose-paragraphs</td>
<td class="left">&#xa0;</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ESC c</td>
<td class="left">cpitalize-word</td>
</tr>

<tr>
<td class="left">ESC n</td>
<td class="left">upcase-word</td>
</tr>

<tr>
<td class="left">ESC - ECS c</td>
<td class="left">negitive-argument;captitalize-word</td>
</tr>

<tr>
<td class="left">ESC - ESC u</td>
<td class="left">negitive-argument;upcase-word</td>
</tr>

<tr>
<td class="left">ESC - ESC l</td>
<td class="left">negtive-argument;downcase-word</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> other</h3>
<div class="outline-text-3" id="text-2-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">INSERT</td>
<td class="left">overwrite-mode</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">rever-buffer</td>
<td class="left"># reload file</td>
</tr>

<tr>
<td class="left">C-x n</td>
<td class="left">advertised-undo</td>
<td class="left"># revoked</td>
</tr>

<tr>
<td class="left">C-_/C-/</td>
<td class="left">undo</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">revert-buffer</td>
<td class="left"># resotre to disk</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">recover-file</td>
<td class="left"># show auto save</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
