source/_posts/tech/emacs/emacs_keys.org
* find and replace
** isearch
| C-s        | isearch-forward  |                     |
| C-r        | isearch-backward |                     |
| RETURN     |                  |                     |
| C-g        | keyboard-quit    |                     |
| DEL        |                  |                     |
| C-s C-w    |                  | select word isearch |
| C-s ESC y  |                  | delete word isearch |
| C-s C-s    |                  | repeat              | 
** simple search
| C-s RETURN |   | Search->Search           |
| C-s        |   | next                     |
| C-r RETURN |   | Search->Search Backwards |
| C-r        |   | back next                |
** replace
| ESC %    |   | Search-Query Replace                |
| SPACE/y  |   | new string relace old               |
| DEL/n    |   | not replace                         |
| .        |   | replace and exit                    |
| ,        |   | replace and stop (y)continue        |
| \!       |   | next all replace                    |
| \^       |   | return up replace location          |
| RETURN/q |   | quit query, replace option          |
| C-r      |   | Recursion editor                    |
| ESC C-c  |   | quit Recursion status, continue     |
| C-]      |   | quit Recursion,query,replace status |
ESC x set-variable RETURN case-fold-search RETURN nil RETURN  # no case
** regexp
| ESC C-s RETURN | re-search-forward       |
| ESC C-r RETURN | re-search-backward      |
| ESC C-s        | isearch-forward-regexp  |
| ESC C-r        | isearch-backward-regexp |
|                | query-relace-regexp     |
|                | replace-regexp          | 
** Ispell
| ESC $     | ispell-word          | check cur location word |
|           | ispell-reglon        | check text work         |
|           | ispell-buffer        | check buffer work       |
|           | ispell-message       | check email text        |
| C-u ESC $ | ispell-continue      | restart run             |
|           | ispell-kill-ispell   | kill ispell             |
| ESC TAB   | ispell-complete-word | text auto completion    | 
** abbrev
|           | abbrev-mode               | on        |
| C-x a -   | inverse-add-global-abbrev | global    |
| C-x a i g |                           | global    |
| C-x a i l | inverse-add-mode-adrev    | local     |
|           | unexpund-abbrev           | undo      |
|           | write-abbrev-file         | save file |
|           | edit-abbrevs              |           |
|           | list-abbrevs              | view      |
|           | kill-all-abbrevs          | off       |
* buffer and window
** window
| C-x 2 | split-window-vertically   |
| C-x 3 | split-window-borttontally |
| C-x > | scroll-right              |
| C-x < | scroll-left               |

** buffer
| C-x b   | switch-to-buffer  |
| C-x C-b | list-buffer       |
| C-x k   | kill-buffer       |
|         | kill-some-buffer  |
|         | rename-buffer     |
| C-x s   | save-some-buffers | 
  
| C-x n | next-buffer                         |
| SPACE | next-buffer                         |
| C-p   | per-buffer                          |
| d     | add del tag 'x' run                 |
| k     | add del tag 'x' run                 |
| s     | add save tag                        |
| n     | add opt tag                         |
| x     | add run tag                         |
| DEL   | del buffer tag                      |
| ~     | buffer add unchange tag             |
| %     | readonly                            |
| 1     | max                                 |
| 2     | self and next buffer to same window |
| f     | change buffer window                |
| o     | move to other window                |
| m     | buffer add visble tag               |
| v     | show 'm' command tag                |
| q     | exit buffer list                    | 
