emacs/emacs_keys.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> find and replace</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> isearch</h3>
<div class="outline-text-3" id="text-3-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-s</td>
<td class="left">isearch-forward</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-r</td>
<td class="left">isearch-backward</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">RETURN</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-g</td>
<td class="left">keyboard-quit</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">DEL</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">C-s C-w</td>
<td class="left">&#xa0;</td>
<td class="left">select word isearch</td>
</tr>

<tr>
<td class="left">C-s ESC y</td>
<td class="left">&#xa0;</td>
<td class="left">delete word isearch</td>
</tr>

<tr>
<td class="left">C-s C-s</td>
<td class="left">&#xa0;</td>
<td class="left">repeat</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> simple search</h3>
<div class="outline-text-3" id="text-3-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-s RETURN</td>
<td class="left">&#xa0;</td>
<td class="left">Search-&gt;Search</td>
</tr>

<tr>
<td class="left">C-s</td>
<td class="left">&#xa0;</td>
<td class="left">next</td>
</tr>

<tr>
<td class="left">C-r RETURN</td>
<td class="left">&#xa0;</td>
<td class="left">Search-&gt;Search Backwards</td>
</tr>

<tr>
<td class="left">C-r</td>
<td class="left">&#xa0;</td>
<td class="left">back next</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> replace</h3>
<div class="outline-text-3" id="text-3-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ESC %</td>
<td class="left">&#xa0;</td>
<td class="left">Search-Query Replace</td>
</tr>

<tr>
<td class="left">SPACE/y</td>
<td class="left">&#xa0;</td>
<td class="left">new string relace old</td>
</tr>

<tr>
<td class="left">DEL/n</td>
<td class="left">&#xa0;</td>
<td class="left">not replace</td>
</tr>

<tr>
<td class="left">.</td>
<td class="left">&#xa0;</td>
<td class="left">replace and exit</td>
</tr>

<tr>
<td class="left">,</td>
<td class="left">&#xa0;</td>
<td class="left">replace and stop (y)continue</td>
</tr>

<tr>
<td class="left">\!</td>
<td class="left">&#xa0;</td>
<td class="left">next all replace</td>
</tr>

<tr>
<td class="left">\^</td>
<td class="left">&#xa0;</td>
<td class="left">return up replace location</td>
</tr>

<tr>
<td class="left">RETURN/q</td>
<td class="left">&#xa0;</td>
<td class="left">quit query, replace option</td>
</tr>

<tr>
<td class="left">C-r</td>
<td class="left">&#xa0;</td>
<td class="left">Recursion editor</td>
</tr>

<tr>
<td class="left">ESC C-c</td>
<td class="left">&#xa0;</td>
<td class="left">quit Recursion status, continue</td>
</tr>

<tr>
<td class="left">C-]</td>
<td class="left">&#xa0;</td>
<td class="left">quit Recursion,query,replace status</td>
</tr>
</tbody>
</table>
<p>
ESC x set-variable RETURN case-fold-search RETURN nil RETURN  # no case
</p>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> regexp</h3>
<div class="outline-text-3" id="text-3-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ESC C-s RETURN</td>
<td class="left">re-search-forward</td>
</tr>

<tr>
<td class="left">ESC C-r RETURN</td>
<td class="left">re-search-backward</td>
</tr>

<tr>
<td class="left">ESC C-s</td>
<td class="left">isearch-forward-regexp</td>
</tr>

<tr>
<td class="left">ESC C-r</td>
<td class="left">isearch-backward-regexp</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">query-relace-regexp</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">replace-regexp</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> Ispell</h3>
<div class="outline-text-3" id="text-3-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ESC $</td>
<td class="left">ispell-word</td>
<td class="left">check cur location word</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ispell-reglon</td>
<td class="left">check text work</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ispell-buffer</td>
<td class="left">check buffer work</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ispell-message</td>
<td class="left">check email text</td>
</tr>

<tr>
<td class="left">C-u ESC $</td>
<td class="left">ispell-continue</td>
<td class="left">restart run</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">ispell-kill-ispell</td>
<td class="left">kill ispell</td>
</tr>

<tr>
<td class="left">ESC TAB</td>
<td class="left">ispell-complete-word</td>
<td class="left">text auto completion</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> abbrev</h3>
<div class="outline-text-3" id="text-3-6">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">abbrev-mode</td>
<td class="left">on</td>
</tr>

<tr>
<td class="left">C-x a -</td>
<td class="left">inverse-add-global-abbrev</td>
<td class="left">global</td>
</tr>

<tr>
<td class="left">C-x a i g</td>
<td class="left">&#xa0;</td>
<td class="left">global</td>
</tr>

<tr>
<td class="left">C-x a i l</td>
<td class="left">inverse-add-mode-adrev</td>
<td class="left">local</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">unexpund-abbrev</td>
<td class="left">undo</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">write-abbrev-file</td>
<td class="left">save file</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">edit-abbrevs</td>
<td class="left">&#xa0;</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">list-abbrevs</td>
<td class="left">view</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">kill-all-abbrevs</td>
<td class="left">off</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> buffer and window</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> window</h3>
<div class="outline-text-3" id="text-4-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x 2</td>
<td class="left">split-window-vertically</td>
</tr>

<tr>
<td class="left">C-x 3</td>
<td class="left">split-window-borttontally</td>
</tr>

<tr>
<td class="left">C-x &gt;</td>
<td class="left">scroll-right</td>
</tr>

<tr>
<td class="left">C-x &lt;</td>
<td class="left">scroll-left</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> buffer</h3>
<div class="outline-text-3" id="text-4-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x b</td>
<td class="left">switch-to-buffer</td>
</tr>

<tr>
<td class="left">C-x C-b</td>
<td class="left">list-buffer</td>
</tr>

<tr>
<td class="left">C-x k</td>
<td class="left">kill-buffer</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">kill-some-buffer</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">rename-buffer</td>
</tr>

<tr>
<td class="left">C-x s</td>
<td class="left">save-some-buffers</td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x n</td>
<td class="left">next-buffer</td>
</tr>

<tr>
<td class="left">SPACE</td>
<td class="left">next-buffer</td>
</tr>

<tr>
<td class="left">C-p</td>
<td class="left">per-buffer</td>
</tr>

<tr>
<td class="left">d</td>
<td class="left">add del tag 'x' run</td>
</tr>

<tr>
<td class="left">k</td>
<td class="left">add del tag 'x' run</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">add save tag</td>
</tr>

<tr>
<td class="left">n</td>
<td class="left">add opt tag</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">add run tag</td>
</tr>

<tr>
<td class="left">DEL</td>
<td class="left">del buffer tag</td>
</tr>

<tr>
<td class="left">~</td>
<td class="left">buffer add unchange tag</td>
</tr>

<tr>
<td class="left">%</td>
<td class="left">readonly</td>
</tr>

<tr>
<td class="left">1</td>
<td class="left">max</td>
</tr>

<tr>
<td class="left">2</td>
<td class="left">self and next buffer to same window</td>
</tr>

<tr>
<td class="left">f</td>
<td class="left">change buffer window</td>
</tr>

<tr>
<td class="left">o</td>
<td class="left">move to other window</td>
</tr>

<tr>
<td class="left">m</td>
<td class="left">buffer add visble tag</td>
</tr>

<tr>
<td class="left">v</td>
<td class="left">show 'm' command tag</td>
</tr>

<tr>
<td class="left">q</td>
<td class="left">exit buffer list</td>
</tr>
</tbody>
</table>
</div>
</div>
