source/_posts/tech/emacs/emacs_keys.org
** bookmark
| C-x r b | bookmark-jump      |
|         | bookmark-delete    |
| C-x r l | bookmark-menu-list |
| d       | bookmark-delete    |
| r       | bookmark-rename    |
| s       | bookmark-save      |
| f       | show tag           |
| m       | add show tag       |
| v       | add visble tag     |
| t       | change tab status  |
| w       | show file location |
| x       | del d tag          |
| u       | del per tag        |
| DEL     | cancel tag opt     |
| q       | exit bookmark list |
|         | bookmark-insert    |
|         | bookmark-write     |
|         | bookmark-load      |
** window block
| C-x 5 o | other-frame                    |
| C-x 5 0 | delete-frame                   |
| C-x 5 2 | makr-frame                     |
| C-x 5 r | find-file-read-only-oher-frame |
| C-x 5 f | find-file-other-frame          |
| C-x 5 b | swith-to-buffer-other-frame    | 

* emacs work
** shell
| C-c C-c | comint-interrupt-subjob    |
| C-d     | comint-delchr-or-maybe-eof |
| C-c C-d | comint-send-eof            |
| C-c C-u | comint-kill-input          |
| C-c C-z | comint-stop-subjob         |
| ESC p   | comint-previous-input      |
| ESC n   | comint-send-input          |
| RETURN  | comint-send-input          |
| TAB     | comint-dynamic-complete    |
| C-c C-o | comint-kill-output         |
| C-c C-r | comint-show-output         |
| C-c C-e | somint-show-maximum-output |
| C-c C-p | comint-previous-prompt     |
| C-c C-n | comint-next-prompt         |
** Dired
| C-x d   | dired                        |
| C       | Dired-do-copy                |
| d       | dired-flag-file-deletion     |
| D       | dired-to-delete              |
| e       | dired-find-file              |
| f       | dired-advertisd-find-file    |
| g       | rever-buffer                 |
| G       | dired-do-chgrp               |
| k       | dired-do-kill-lines          |
| m       | dired-mark                   |
| n       | dired-next-line              |
| o       | dired-find-file-other-window |
| C-o     | dired-display-file           |
| P       | dired-do-print               |
| q       | dired-quit                   |
| Q       | dired-do-query-replace       |
| R       | dired-do-rename              |
| u       | dired-unmark                 |
| v       | dired-view-file              |
| x       | dired-do-flagged-delete      |
| Z       | dired-do-compress            |
| ESC DEL | dired-unmark-all-files       |
| ~       | dired-flag-backup-files      |
| *       | dired-mark-executables       |
| #       | dired-flag-auto-save-files   |
| `       | dired-clean-directory        |
| /       | dired-mark-directories       |
| =       | dired-diff                   |
| ESC =   | dired-bakup-diff             |
| !       | dired-do-shell-command       |
| ESC )   | dired-next-mark-file         |
| ESC (   | dired-prev-marked-file       |
| %d      | dired-flag-files-regexp      |
| %m      | dired-mark-files-regexp      |
| +       | dired-creat-directory        |
| >       | dired-next-dirline           |
| <       | dired-prev-dirline           |
| S       | dired-sort-toggle-or-edit    | 
** print
| ESC x print-buffer               |
| ESC x print-region               |
| ESC x lpr-buffer                 |
| ESC x lpr-region                 |
| ESC x dired-do-print             |
| ESC x ps-print-buffer-with-faces | 
** time
| display-time |
| calendar     |
** calendar
| .     | calendar-goto-today         |
| C-f   | calendar-forward-day        |
| C-b   | calendar-backward-day       |
| C-n   | calendar-forward-week       |
| C-p   | calendar-backward-week      |
| ESC } | calendar-forward-month      |
| ESC { | calendar-backward-month     |
| C-x ] | calendar-forward-year       |
| C-x [ | calendar-backward-year      |
| C-a   | calendar-gedinning-of-week  |
| C-e   | calendar-end-of-week        |
| ESC a | calendar-beginning-of-month |
| ESC e | calendar-end-of-month       |
| ESC < | calendar-beginning-of-year  |
| ESC > | calendar-beginning-of-year  |
| C-u n | nuiversal-argument          |
| g d   | calendar-goto-date          |
| o     | calendar-other-month        |
| C-x < | scroll-calendar-left        |
| C-x > | scroll-calendar-right       |
| SPACE | scroll-other-window         |
* mail
