emacs/emacs_keys.html
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> bookmark</h3>
<div class="outline-text-3" id="text-4-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x r b</td>
<td class="left">bookmark-jump</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">bookmark-delete</td>
</tr>

<tr>
<td class="left">C-x r l</td>
<td class="left">bookmark-menu-list</td>
</tr>

<tr>
<td class="left">d</td>
<td class="left">bookmark-delete</td>
</tr>

<tr>
<td class="left">r</td>
<td class="left">bookmark-rename</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">bookmark-save</td>
</tr>

<tr>
<td class="left">f</td>
<td class="left">show tag</td>
</tr>

<tr>
<td class="left">m</td>
<td class="left">add show tag</td>
</tr>

<tr>
<td class="left">v</td>
<td class="left">add visble tag</td>
</tr>

<tr>
<td class="left">t</td>
<td class="left">change tab status</td>
</tr>

<tr>
<td class="left">w</td>
<td class="left">show file location</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">del d tag</td>
</tr>

<tr>
<td class="left">u</td>
<td class="left">del per tag</td>
</tr>

<tr>
<td class="left">DEL</td>
<td class="left">cancel tag opt</td>
</tr>

<tr>
<td class="left">q</td>
<td class="left">exit bookmark list</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">bookmark-insert</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">bookmark-write</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">bookmark-load</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-4-4" class="outline-3">
<h3 id="sec-4-4"><span class="section-number-3">4.4</span> window block</h3>
<div class="outline-text-3" id="text-4-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x 5 o</td>
<td class="left">other-frame</td>
</tr>

<tr>
<td class="left">C-x 5 0</td>
<td class="left">delete-frame</td>
</tr>

<tr>
<td class="left">C-x 5 2</td>
<td class="left">makr-frame</td>
</tr>

<tr>
<td class="left">C-x 5 r</td>
<td class="left">find-file-read-only-oher-frame</td>
</tr>

<tr>
<td class="left">C-x 5 f</td>
<td class="left">find-file-other-frame</td>
</tr>

<tr>
<td class="left">C-x 5 b</td>
<td class="left">swith-to-buffer-other-frame</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> emacs work</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> shell</h3>
<div class="outline-text-3" id="text-5-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-c C-c</td>
<td class="left">comint-interrupt-subjob</td>
</tr>

<tr>
<td class="left">C-d</td>
<td class="left">comint-delchr-or-maybe-eof</td>
</tr>

<tr>
<td class="left">C-c C-d</td>
<td class="left">comint-send-eof</td>
</tr>

<tr>
<td class="left">C-c C-u</td>
<td class="left">comint-kill-input</td>
</tr>

<tr>
<td class="left">C-c C-z</td>
<td class="left">comint-stop-subjob</td>
</tr>

<tr>
<td class="left">ESC p</td>
<td class="left">comint-previous-input</td>
</tr>

<tr>
<td class="left">ESC n</td>
<td class="left">comint-send-input</td>
</tr>

<tr>
<td class="left">RETURN</td>
<td class="left">comint-send-input</td>
</tr>

<tr>
<td class="left">TAB</td>
<td class="left">comint-dynamic-complete</td>
</tr>

<tr>
<td class="left">C-c C-o</td>
<td class="left">comint-kill-output</td>
</tr>

<tr>
<td class="left">C-c C-r</td>
<td class="left">comint-show-output</td>
</tr>

<tr>
<td class="left">C-c C-e</td>
<td class="left">somint-show-maximum-output</td>
</tr>

<tr>
<td class="left">C-c C-p</td>
<td class="left">comint-previous-prompt</td>
</tr>

<tr>
<td class="left">C-c C-n</td>
<td class="left">comint-next-prompt</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Dired</h3>
<div class="outline-text-3" id="text-5-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x d</td>
<td class="left">dired</td>
</tr>

<tr>
<td class="left">C</td>
<td class="left">Dired-do-copy</td>
</tr>

<tr>
<td class="left">d</td>
<td class="left">dired-flag-file-deletion</td>
</tr>

<tr>
<td class="left">D</td>
<td class="left">dired-to-delete</td>
</tr>

<tr>
<td class="left">e</td>
<td class="left">dired-find-file</td>
</tr>

<tr>
<td class="left">f</td>
<td class="left">dired-advertisd-find-file</td>
</tr>

<tr>
<td class="left">g</td>
<td class="left">rever-buffer</td>
</tr>

<tr>
<td class="left">G</td>
<td class="left">dired-do-chgrp</td>
</tr>

<tr>
<td class="left">k</td>
<td class="left">dired-do-kill-lines</td>
</tr>

<tr>
<td class="left">m</td>
<td class="left">dired-mark</td>
</tr>

<tr>
<td class="left">n</td>
<td class="left">dired-next-line</td>
</tr>

<tr>
<td class="left">o</td>
<td class="left">dired-find-file-other-window</td>
</tr>

<tr>
<td class="left">C-o</td>
<td class="left">dired-display-file</td>
</tr>

<tr>
<td class="left">P</td>
<td class="left">dired-do-print</td>
</tr>

<tr>
<td class="left">q</td>
<td class="left">dired-quit</td>
</tr>

<tr>
<td class="left">Q</td>
<td class="left">dired-do-query-replace</td>
</tr>

<tr>
<td class="left">R</td>
<td class="left">dired-do-rename</td>
</tr>

<tr>
<td class="left">u</td>
<td class="left">dired-unmark</td>
</tr>

<tr>
<td class="left">v</td>
<td class="left">dired-view-file</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">dired-do-flagged-delete</td>
</tr>

<tr>
<td class="left">Z</td>
<td class="left">dired-do-compress</td>
</tr>

<tr>
<td class="left">ESC DEL</td>
<td class="left">dired-unmark-all-files</td>
</tr>

<tr>
<td class="left">~</td>
<td class="left">dired-flag-backup-files</td>
</tr>

<tr>
<td class="left">*</td>
<td class="left">dired-mark-executables</td>
</tr>

<tr>
<td class="left">#</td>
<td class="left">dired-flag-auto-save-files</td>
</tr>

<tr>
<td class="left">`</td>
<td class="left">dired-clean-directory</td>
</tr>

<tr>
<td class="left">=</td>
<td class="left">dired-diff</td>
</tr>

<tr>
<td class="left">ESC =</td>
<td class="left">dired-bakup-diff</td>
</tr>

<tr>
<td class="left">!</td>
<td class="left">dired-do-shell-command</td>
</tr>

<tr>
<td class="left">ESC )</td>
<td class="left">dired-next-mark-file</td>
</tr>

<tr>
<td class="left">ESC (</td>
<td class="left">dired-prev-marked-file</td>
</tr>

<tr>
<td class="left">%d</td>
<td class="left">dired-flag-files-regexp</td>
</tr>

<tr>
<td class="left">%m</td>
<td class="left">dired-mark-files-regexp</td>
</tr>

<tr>
<td class="left">+</td>
<td class="left">dired-creat-directory</td>
</tr>

<tr>
<td class="left">&gt;</td>
<td class="left">dired-next-dirline</td>
</tr>

<tr>
<td class="left">&lt;</td>
<td class="left">dired-prev-dirline</td>
</tr>

<tr>
<td class="left">S</td>
<td class="left">dired-sort-toggle-or-edit</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> print</h3>
<div class="outline-text-3" id="text-5-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ESC x print-buffer</td>
</tr>

<tr>
<td class="left">ESC x print-region</td>
</tr>

<tr>
<td class="left">ESC x lpr-buffer</td>
</tr>

<tr>
<td class="left">ESC x lpr-region</td>
</tr>

<tr>
<td class="left">ESC x dired-do-print</td>
</tr>

<tr>
<td class="left">ESC x ps-print-buffer-with-faces</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> time</h3>
<div class="outline-text-3" id="text-5-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">display-time</td>
</tr>

<tr>
<td class="left">calendar</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> calendar</h3>
<div class="outline-text-3" id="text-5-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">.</td>
<td class="left">calendar-goto-today</td>
</tr>

<tr>
<td class="left">C-f</td>
<td class="left">calendar-forward-day</td>
</tr>

<tr>
<td class="left">C-b</td>
<td class="left">calendar-backward-day</td>
</tr>

<tr>
<td class="left">C-n</td>
<td class="left">calendar-forward-week</td>
</tr>

<tr>
<td class="left">C-p</td>
<td class="left">calendar-backward-week</td>
</tr>

<tr>
<td class="left">ESC }</td>
<td class="left">calendar-forward-month</td>
</tr>

<tr>
<td class="left">ESC {</td>
<td class="left">calendar-backward-month</td>
</tr>

<tr>
<td class="left">C-x ]</td>
<td class="left">calendar-forward-year</td>
</tr>

<tr>
<td class="left">C-x [</td>
<td class="left">calendar-backward-year</td>
</tr>

<tr>
<td class="left">C-a</td>
<td class="left">calendar-gedinning-of-week</td>
</tr>

<tr>
<td class="left">C-e</td>
<td class="left">calendar-end-of-week</td>
</tr>

<tr>
<td class="left">ESC a</td>
<td class="left">calendar-beginning-of-month</td>
</tr>

<tr>
<td class="left">ESC e</td>
<td class="left">calendar-end-of-month</td>
</tr>

<tr>
<td class="left">ESC &lt;</td>
<td class="left">calendar-beginning-of-year</td>
</tr>

<tr>
<td class="left">ESC &gt;</td>
<td class="left">calendar-beginning-of-year</td>
</tr>

<tr>
<td class="left">C-u n</td>
<td class="left">nuiversal-argument</td>
</tr>

<tr>
<td class="left">g d</td>
<td class="left">calendar-goto-date</td>
</tr>

<tr>
<td class="left">o</td>
<td class="left">calendar-other-month</td>
</tr>

<tr>
<td class="left">C-x &lt;</td>
<td class="left">scroll-calendar-left</td>
</tr>

<tr>
<td class="left">C-x &gt;</td>
<td class="left">scroll-calendar-right</td>
</tr>

<tr>
<td class="left">SPACE</td>
<td class="left">scroll-other-window</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
