source/_posts/tech/emacs/emacs_keys.org
** mail send
| C-x m       | mail               |
| C-x 4 m     | mail-other-window  |
| C-x 5 m     | mail-other-frame   |
| C-c C-f C-t | mail-to            |
| C-c C-f C-c | mail-cc            |
| C-c C-f C-b | mail-bcc           |
| C-c C-f C-f | mail-fcc           |
| C-c C-f C-r | mail-reply-to      |
| C-c C-f C-s | mail-subject       |
| C-c C-t     | mail-text          |
| C-c C-w     | mail-signature     |
| C-c C-c     | mail-send-and-exit |
| C-c C-s     | mail-send          |
|             | defind-mail-alias  |
|             | mail-dont-send     | 
** mail read  
| SPACE | scroll-up                        |
| DEL   | scroll-down                      |
| .     | rmail-beginning-of-message       |
| n     | rmail-next-undeleted-message     |
| p     | rmail-previour-undeleted-message |
| <     | rmail-first-message              |
| >     | rmail-last-message               |
| j     | rmail-show-message               | 
** del mail
| d     | rmail-delete-forward            |
| C-d   | rmail-delete-backward           |
| ESC n | rmail-next-message              |
| ESC p | rmail-previous-message          |
| u     | rmail-undelete-previour-message |
| x     | rmail-expunge                   |
| s     | rmail-expunge-and-save          |
** save mail
| o filename RETURN   | rmail-output-to-rmail-file |
| C-o filename RETURN | rmail-output               |
| i filename RETURN   | rmail-input                |
|                     | unrmail                    | 
** gnus
|         | gnus                                 |
| SPACE   | gnus-group-read-group                |
| j       | gnus-group-jump-to-group             |
| n       | gnus-group-next-unread-group         |
| p       | gnus-group-prev-unread-group         |
| N       | gnus-group-next-group                |
| P       | gnus-group-prev-group                |
| <       | beginning-of-buffer                  |
| >       | end-of-buffer                        |
| u       | gnus-group-unsubseribe-current-group |
| U       | gnus-group-unsubscribe-group         |
| c       | gnus-group-catchup-current           |
| C       | gnus-group-catchup-current-all       |
| A k     | gnus-group-list-killed               |
| I       | gnus-group-list-groups               |
| L       | gnus-group-list-all-groups           |
| g       | gnus-group-get-new-news              |
| R       | gnus-group-restart                   |
| b       | gnus-group-check-bogus-groups        |
| a       | gnus-group-post-news                 |
| C-x C-t | gnus-group-transpose-groups          |
| s       | gnus-group-save-newrc                |
| z       | gnus-group-suspend                   |
| q       | gnus-group-exit                      |
| Q       | gnus-group-quit                      |
| V       | gnus-version                         |
