emacs/emacs_keys.html
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> mail</h2>
<div class="outline-text-2" id="text-6">
</div><div id="outline-container-sec-6-1" class="outline-3">
<h3 id="sec-6-1"><span class="section-number-3">6.1</span> mail send</h3>
<div class="outline-text-3" id="text-6-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">C-x m</td>
<td class="left">mail</td>
</tr>

<tr>
<td class="left">C-x 4 m</td>
<td class="left">mail-other-window</td>
</tr>

<tr>
<td class="left">C-x 5 m</td>
<td class="left">mail-other-frame</td>
</tr>

<tr>
<td class="left">C-c C-f C-t</td>
<td class="left">mail-to</td>
</tr>

<tr>
<td class="left">C-c C-f C-c</td>
<td class="left">mail-cc</td>
</tr>

<tr>
<td class="left">C-c C-f C-b</td>
<td class="left">mail-bcc</td>
</tr>

<tr>
<td class="left">C-c C-f C-f</td>
<td class="left">mail-fcc</td>
</tr>

<tr>
<td class="left">C-c C-f C-r</td>
<td class="left">mail-reply-to</td>
</tr>

<tr>
<td class="left">C-c C-f C-s</td>
<td class="left">mail-subject</td>
</tr>

<tr>
<td class="left">C-c C-t</td>
<td class="left">mail-text</td>
</tr>

<tr>
<td class="left">C-c C-w</td>
<td class="left">mail-signature</td>
</tr>

<tr>
<td class="left">C-c C-c</td>
<td class="left">mail-send-and-exit</td>
</tr>

<tr>
<td class="left">C-c C-s</td>
<td class="left">mail-send</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">defind-mail-alias</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">mail-dont-send</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> mail read</h3>
<div class="outline-text-3" id="text-6-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">SPACE</td>
<td class="left">scroll-up</td>
</tr>

<tr>
<td class="left">DEL</td>
<td class="left">scroll-down</td>
</tr>

<tr>
<td class="left">.</td>
<td class="left">rmail-beginning-of-message</td>
</tr>

<tr>
<td class="left">n</td>
<td class="left">rmail-next-undeleted-message</td>
</tr>

<tr>
<td class="left">p</td>
<td class="left">rmail-previour-undeleted-message</td>
</tr>

<tr>
<td class="left">&lt;</td>
<td class="left">rmail-first-message</td>
</tr>

<tr>
<td class="left">&gt;</td>
<td class="left">rmail-last-message</td>
</tr>

<tr>
<td class="left">j</td>
<td class="left">rmail-show-message</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-3" class="outline-3">
<h3 id="sec-6-3"><span class="section-number-3">6.3</span> del mail</h3>
<div class="outline-text-3" id="text-6-3">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">d</td>
<td class="left">rmail-delete-forward</td>
</tr>

<tr>
<td class="left">C-d</td>
<td class="left">rmail-delete-backward</td>
</tr>

<tr>
<td class="left">ESC n</td>
<td class="left">rmail-next-message</td>
</tr>

<tr>
<td class="left">ESC p</td>
<td class="left">rmail-previous-message</td>
</tr>

<tr>
<td class="left">u</td>
<td class="left">rmail-undelete-previour-message</td>
</tr>

<tr>
<td class="left">x</td>
<td class="left">rmail-expunge</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">rmail-expunge-and-save</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-4" class="outline-3">
<h3 id="sec-6-4"><span class="section-number-3">6.4</span> save mail</h3>
<div class="outline-text-3" id="text-6-4">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">o filename RETURN</td>
<td class="left">rmail-output-to-rmail-file</td>
</tr>

<tr>
<td class="left">C-o filename RETURN</td>
<td class="left">rmail-output</td>
</tr>

<tr>
<td class="left">i filename RETURN</td>
<td class="left">rmail-input</td>
</tr>

<tr>
<td class="left">&#xa0;</td>
<td class="left">unrmail</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-6-5" class="outline-3">
<h3 id="sec-6-5"><span class="section-number-3">6.5</span> gnus</h3>
<div class="outline-text-3" id="text-6-5">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">&#xa0;</td>
<td class="left">gnus</td>
</tr>

<tr>
<td class="left">SPACE</td>
<td class="left">gnus-group-read-group</td>
</tr>

<tr>
<td class="left">j</td>
<td class="left">gnus-group-jump-to-group</td>
</tr>

<tr>
<td class="left">n</td>
<td class="left">gnus-group-next-unread-group</td>
</tr>

<tr>
<td class="left">p</td>
<td class="left">gnus-group-prev-unread-group</td>
</tr>

<tr>
<td class="left">N</td>
<td class="left">gnus-group-next-group</td>
</tr>

<tr>
<td class="left">P</td>
<td class="left">gnus-group-prev-group</td>
</tr>

<tr>
<td class="left">&lt;</td>
<td class="left">beginning-of-buffer</td>
</tr>

<tr>
<td class="left">&gt;</td>
<td class="left">end-of-buffer</td>
</tr>

<tr>
<td class="left">u</td>
<td class="left">gnus-group-unsubseribe-current-group</td>
</tr>

<tr>
<td class="left">U</td>
<td class="left">gnus-group-unsubscribe-group</td>
</tr>

<tr>
<td class="left">c</td>
<td class="left">gnus-group-catchup-current</td>
</tr>

<tr>
<td class="left">C</td>
<td class="left">gnus-group-catchup-current-all</td>
</tr>

<tr>
<td class="left">A k</td>
<td class="left">gnus-group-list-killed</td>
</tr>

<tr>
<td class="left">I</td>
<td class="left">gnus-group-list-groups</td>
</tr>

<tr>
<td class="left">L</td>
<td class="left">gnus-group-list-all-groups</td>
</tr>

<tr>
<td class="left">g</td>
<td class="left">gnus-group-get-new-news</td>
</tr>

<tr>
<td class="left">R</td>
<td class="left">gnus-group-restart</td>
</tr>

<tr>
<td class="left">b</td>
<td class="left">gnus-group-check-bogus-groups</td>
</tr>

<tr>
<td class="left">a</td>
<td class="left">gnus-group-post-news</td>
</tr>

<tr>
<td class="left">C-x C-t</td>
<td class="left">gnus-group-transpose-groups</td>
</tr>

<tr>
<td class="left">s</td>
<td class="left">gnus-group-save-newrc</td>
</tr>

<tr>
<td class="left">z</td>
<td class="left">gnus-group-suspend</td>
</tr>

<tr>
<td class="left">q</td>
<td class="left">gnus-group-exit</td>
</tr>

<tr>
<td class="left">Q</td>
<td class="left">gnus-group-quit</td>
</tr>

<tr>
<td class="left">V</td>
<td class="left">gnus-version</td>
</tr>
</tbody>
</table>
</div>
