source/_posts/tech/emacs/emacs_keys.org
*** summary
| SPACE   | gnus-summary-next-page                   |   |   |   |   |
| DEL     | gnus-summary-prev-page                   |   |   |   |   |
| RETURN  | gnus-summary-scroll-up                   |   |   |   |   |
| .       | gnus-summary-first-unread-article        |   |   |   |   |
| <       | gnus-summary-beginning-of-article        |   |   |   |   |
| >       | gnus-summary-end-of-article              |   |   |   |   |
| n       | gnus-summary-next-unread-artcle          |   |   |   |   |
| N       | gnus-summary-next-article                |   |   |   |   |
| p       | gnus-summary-prev-unread-article         |   |   |   |   |
| P       | gnus-summary-prev-article                |   |   |   |   |
| l       | gnus-summary-goto-last-article           |   |   |   |   |
| H f     | gnus-summary-fetch-faq                   |   |   |   |   |
| ESC C-t | gnus-summary-toggle-thread               |   |   |   |   |
| ESC C-k | gnus-summary-kill-thread                 |   |   |   |   |
| ESC C-d | gnus-summary-down-thread                 |   |   |   |   |
| ESC C-u | gnus-summary-up-thread                   |   |   |   |   |
| ESC C-f | gnus-summary-next-thread                 |   |   |   |   |
| ESC C-b | gnus-summary-prev-thread                 |   |   |   |   |
| ESC C-h | gnus-summary-hide-thread                 |   |   |   |   |
| ESC C-s | gnus-summary-showthread                  |   |   |   |   |
| q       | gnus-summary-exit                        |   |   |   |   |
| Q       | gnus-summary-exit                        |   |   |   |   |
| c       | gnus-summary-catchup-and-exit            |   |   |   |   |
| u       | gnus-summary-tick-article-forward        |   |   |   |   |
| U       | gnus-summary-tic-article-backward        |   |   |   |   |
| C-o     | gnus-summary-save-article-mail           |   |   |   |   |
| o       | gnus-summary-save-article                |   |   |   |   |
| d       | gnus-summary-mark-as-read-backward       |   |   |   |   |
| D       | gnus-summary-mark-as-read-backward       |   |   |   |   |
| j       | guns-summary-goto-subject                |   |   |   |   |
| ESC n   | gnus-summary-next-unread-subject         |   |   |   |   |
| ESC p   | gnus-summary-prev-unread-subject         |   |   |   |   |
| ESC C-n | gnus-summary-next-save-subject           |   |   |   |   |
| ESC C-p | gnus-summary-prev-save-subject           |   |   |   |   |
| m       | gnus-summary-mail-other-window           |   |   |   |   |
| C-c C-f | gnus-summary-mail-forward                |   |   |   |   |
| =       | guns-summary-expand-window               |   |   |   |   |
| g       | gnus-summary-show-article                |   |   |   |   |
| s       | gnus-summary-isearch-article             |   |   |   |   |
| ESC s   | gnus-summary-search-article-forward      |   |   |   |   |
| ESC r   | gnus-summary-search-article-backward     |   |   |   |   |
| t       | gnus-summary-toggle-header               |   |   |   |   |
| w       | gnus-summary-stop-page-breaking          |   |   |   |   |
| x       | gnus-summary-remove-lines-marked-as-read |   |   |   |   |
| C-c TAB | gnus-info-find-node                      |   |   |   |   |
| C-c C-r | gnus-summary-caesar-message              |   |   |   |   |
| C-x C-s | gnus-summary-reselect-current-group      |   |   |   |   |
| ESC t   | gnus-summary-toggle-mime                 |   |   |   |   |
| ESC U   | gnus-summary-clear-mark-backward         |   |   |   |   |
| ESC u   | gnus-summary-clear-mark-forward          |   |   |   |   |
| C-t     | gnus-summary-toggle-truncation           |   |   |   |   |
| &       | gnus-summary-execute-command             |   |   |   |   |
|         | gnus-summary-pipe-output                 |   |   |   |   |
| C-d     | gnus-summary-rmail-digest                |   |   |   |   | 
